{"1": "medRxiv preprint \npreprint \n\n(which was not certified by peer review)\n\ndoi: \n\nhttps://doi.org/10.1101/2020.12.27.20248896\n; \n\nThe copyright holder for this\n is the author/funder, who has granted medRxiv a license to display the preprint in\n\nthis version posted January 26, 2021. \n\nIt is made available under a \n\nperpetuity. \nCC-BY-NC-ND 4.0 International license\n\n . \n\nSummary\nBackground The announcement of ecacious vaccine candidates against SARS-CoV-2 has been\nmet with worldwide acclaim and relief. Many countries already have detailed plans for vaccine\ntargeting based on minimising severe illness, death and healthcare burdens. Normally, relatively\nsimple relationships between epidemiological parameters, vaccine ecacy and vaccine uptake\npredict the success of any immunisation programme. However, the dynamics of vaccination\nagainst SARS-CoV-2 is made more complex by age-dependent factors, changing levels of infection\nand the potential relaxation of non-pharmaceutical interventions (NPIs) as the perceived risk\ndeclines.\nMethods In this study we use an age-structured mathematical model, matched to a range\nof epidemiological data in the UK, that also captures the roll-out of a two-dose vaccination\nprogramme targeted at specic age groups.\nFindings We consider the interaction between the UK vaccination programme and future relax-\nation (or removal) of NPIs. Our predictions highlight the population-level risks of early relaxation\nleading to a pronounced wave of infection, hospital admissions and deaths. Only vaccines that\noer high infection-blocking ecacy with high uptake in the general population allow relaxation\nof NPIs without a huge surge in deaths.\nInterpretation While the novel vaccines against SARS-CoV-2 oer a potential exit strategy\nfor this outbreak, this is highly contingent on the infection-blocking (or transmission-blocking)\naction of the vaccine and the population uptake, both of which need to be carefully monitored\nas vaccine programmes are rolled out in the UK and other countries.\n\nResearch in context\n\nEvidence before this study\nVaccination has been seen as a key tool in the ght against SARS-CoV-2. The vaccines\nalready developed represent a major technological achievement and have been shown to\ngenerate signicant immune responses, as well as oering considerable protection against\ndisease. However, to date there is limited information on the degree of infection-blocking\nthese vaccines are likely to induce. Mathematical models have already successfully been\nused to consider age- and risk-structured targeting of vaccination, highlighting the im-\nportance of prioritising older and high-risk individuals.\nAdded value of this study\nTranslating current knowledge and uncertainty of vaccine behaviour into meaningful pub-\nlic health messages requires models that fully capture the within-country epidemiology\nas well as the complex roll-out of a two-dose vaccination programme. We show that un-\nder reasonable assumptions for vaccine ecacy and uptake the UK is unlikely to reach\nherd immunity, which means that non-pharmaceutical interventions cannot be released\nwithout generating substantial waves of infection.\nImplications of all the available evidence\nVaccination is likely to provide substantial individual protection to those receiving two\ndoses, but the degree of protection to the wider population is still uncertain. While\nsubstantial immunisation of the most vulnerable groups will allow for some relaxation of\ncontrols, this must be done gradually to prevent large scale public health consequences.\n\n1 Introduction\nThe outbreak of SARS-CoV-2 that began in Wuhan, China, in late 2019 dramatically shaped\nlife in 2020 as a world-wide pandemic emerged1. In the UK, the rst cases were identied on\n31st January 2020 2, with February and March witnessing an exponential rise in cases3. The\nrst lockdown began on 23rd March and reversed the growth in infection, although important\nhealth metrics such as hospital occupancy and deaths continued to increase for several days4.\nThe steady, but spatially heterogeneous, decline continued until August 2020 when a relaxation\nof controls and increased mixing as a result of this precipitated a second wave and, subsequently,\na second lockdown in November 2020. By early December 2020, the UK had suered over 60,000\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n2\n\n\f", "2": "medRxiv preprint \npreprint \n\n(which was not certified by peer review)\n\ndoi: \n\nhttps://doi.org/10.1101/2020.12.27.20248896\n; \n\nThe copyright holder for this\n is the author/funder, who has granted medRxiv a license to display the preprint in\n\nthis version posted January 26, 2021. \n\nIt is made available under a \n\nperpetuity. \nCC-BY-NC-ND 4.0 International license\n\n . \n\ndeaths and 225,000 hospital admissions owing to COVID-19 and yet it is estimated that less\nthan 20% of the population has been exposed to the virus5, suggesting the outbreak is far from\ncomplete. Mass vaccination, and hence protection, of the population oers a potentially rapid\nexit strategy.\nWithin a year, over 50 companies have developed the rst vaccines against any coronavirus.\nIn early December 2020, one of these (Pzer/BioNTechs BNT162b26) was approved for use in\nthe UK, with several others in late Phase 3 trials at that time showing promising preliminary\necacy data. As of 12th December 2020, the UK had ordered 357 million doses of vaccines\nfrom 7 dierent developers: 100 million doses of University of Oxford/AstraZeneca vaccine7;\n40 million doses of BioNTech/Pzer vaccine; 7 million doses of Moderna vaccine; 60 million\ndoses of Novavax vaccine; 60 million doses of Valneva vaccine; 60 million doses of GSK/Sano\nPasteur vaccine; and 30 million doses of Janssen vaccine 8. This is far in excess of any possible\ndemand from the UK population, but mitigates for potential delays or failures from any single\nmanufacturer. One continuing unknown with the potential vaccines is the degree to which they\nimpact onward transmission (rather than simply preventing symptomatic infection); this is a key\nuncertainty that is investigated throughout this paper.\nVaccination against SARS-CoV-2 provides multiple unique challenges that are not encountered\nby other vaccination programmes. Most of the intuition about vaccination programmes is based\non childhood vaccines where the aim is simply to achieve high uptake in each birth cohort and\nassociated boosters. To date the seasonal inuenza programme represented the largest annual\ndelivery of vaccination in the UK 9, but seasonal inuenza immunisation is pro-active (beginning\nbefore many cases arise), the u season is of relatively short duration and R for seasonal\ninuenza is lower than for SARS-CoV-2 owing to both greater population immunity and a lower\nbasic reproduction ratio 10. In contrast, for SARS-CoV-2 there is a race between infection and\nvaccination - vaccination rates are limited by supply and logistics, whereas infection can grow\nexponentially. However, the infection rate can be reduced by a range of non-pharmaceutical\ninterventions (NPIs) whilst a vaccine can be targeted to where it will have the most impact11.\nThe future of COVID-19 control is therefore dependent, in a complex non-linear way, on the\ninitial prevalence of infection, the level of NPIs and therefore the rate of growth or decay,\nthe speed with which the vaccine can be rolled out, the targeting and uptake of the vaccine\nand the vaccine characteristics. The uncertainties and interactions between these components\nnecessitates the use of mathematical models to explore scenarios.\nHere, we present an age-structured mathematical model, matched to a range of epidemiological\ndata, to forecast the dynamics of COVID-19 in 2021 and beyond based on multiple combinations\nof scenarios. These model results provide likely bounds on the expected number of deaths and\nhospitalisations, thus providing important policy insights into the interaction between continued\nnon-pharmaceutical interventions and the ongoing vaccination programme. We focus on the\nrisk-structured delivery programme for the UK and the potential risks of relaxing NPIs; we also\nconsider the individual risks and how these are mitigated by vaccination.\n\n2 The mathematical model and vaccination assumptions\nWe adapt an existing age and regionally structured model of SARS-COV-2 dynamics that has\nbeen matched to UK data 12,13 to include the consequences of vaccination 11. The model captures\nthe historic trends of infection, hospitalisation and deaths in the UK, including the scale of the\nrst and second waves. Including vaccination into this model shows how prioritising the oldest\nage-groups leads to the greatest reduction in deaths 11. Here we increase the realism of the\nvaccination dynamics, including the timing of vaccine roll out across the population and the\nneed to administer two doses. One key issue that the model cannot address is the level of NPIs\nthat will be imposed in the future and the level of support (and therefore adherence to NPIs)\nfrom the general population. We have optimistically assumed that controls in the short term are\nsucient to keep the reproductive number (R) just below one; we then relax controls at various\ntimes throughout 2021 to investigate the level of protection generated by vaccination. All results\nrepresent the mean of multiple simulations which explore the inferred epidemiological parameter\nspace determined by matching to a range of epidemiological time series; credible intervals for\nthe predictions are shown in the Supplementary Material.\nVaccination schedules for the UK are still not determined over long time scales, although the im-\n\n3\n\n10\n\n11\n\n12\n\n13\n\n14\n\n15\n\n16\n\n17\n\n18\n\n19\n\n20\n\n21\n\n22\n\n23\n\n24\n\n25\n\n26\n\n27\n\n28\n\n29\n\n30\n\n31\n\n32\n\n33\n\n34\n\n35\n\n36\n\n37\n\n38\n\n39\n\n40\n\n41\n\n42\n\n43\n\n44\n\n45\n\n46\n\n47\n\n48\n\n49\n\n50\n\n51\n\n52\n\n53\n\n54\n\n55\n\n56\n\n57\n\n58\n\n59\n\n60\n\n61\n\n62\n\n63\n\n64\n\n\f", "3": "medRxiv preprint \npreprint \n\n(which was not certified by peer review)\n\ndoi: \n\nhttps://doi.org/10.1101/2020.12.27.20248896\n; \n\nThe copyright holder for this\n is the author/funder, who has granted medRxiv a license to display the preprint in\n\nthis version posted January 26, 2021. \n\nIt is made available under a \n\nperpetuity. \nCC-BY-NC-ND 4.0 International license\n\n . \n\nmediate priority order has been dened11,14. We implement an accelerating delivery programme\nthat approximates plausible roll-out of SARS-CoV-2 vaccination in the UK (Figure 1(a)), fol-\nlowing in each stage the identied priority ordering:\n\n 1 million doses of Pzer/BioNTech vaccine alone across December.\n 1 million doses per week from the start of January, increasing to 2m per week by February\n\nusing a mixture of vaccines.\n\n 2 million doses per week from the start of February until vaccine completion using a mixture\n\nof vaccines.\n\nThroughout, we assume 95% uptake in care homes, 85% elsewhere above the age of 50 and 75%\nbelow the age of 50 for dose 1, dropping to 75% and 66% for above and below 50 respectively for\ndose 2. In practice, vaccination is also likely to be highly correlated within households and socio-\ndemographic groups 15, which will weaken the population-scale impact of any infection blocking\nby the vaccine.\n\nFigure 1: Scheduling and impact of vaccine uptake. (Left) The assumed uptake over time showing the\nproportion in each age-group that have received two doses of vaccine by the total number of doses (lower x-axis) or\na given date (upper x-axis). Darker shading corresponds to a greater proportion vaccinated. (Right) The impact of\nthe vaccination programme, dened by the number of administered doses, on the reproductive ratio R in the absence\nof all non-pharmaceutical interventions. We display four dierent assumptions about the ability of the vaccine to\nblock infection and hence stop further transmission: 0%, 35%, 60% and 85% reduction in infection due to two doses\nof the vaccine.\n\nWe use a 2-dose model to simulate the impact of vaccination in both reducing infection (and\nhence onward transmission) and in reducing symptomatic disease. We assume that delivery of\nthe second dose is prioritised over new rst doses, with a minimum 84 day delay between doses\n(Figure 1(a)). In the absence of detailed vaccine specic information, we also assume a stepped\necacy over time following the rst dose, which scales with the assumed nal vaccine ecacy\n(VE): from the rst dose to day 14, zero ecacy; from day 14 to second dose on day 84, 80%\nof VE; from day 84 to day 98, 80% of VE; from day 98 onwards, 100% of VE (Supplementary\nMaterial).\nVaccine ecacy against disease is assumed to be high (in keeping with preliminary reports): 94%\nduring the earliest phase where just the Pzer/BioNTech vaccine is used, dropping to 89% (on\naverage) when multiple vaccines are in use. The role of vaccines in blocking infection, and hence\nonward transmission, is less clear so we consider a range of infection ecacy from 0% to 85%,\nwhich we assume operates by preventing primary infection. We note that the disease ecacy\ntakes into account both infection blocking and the reduction of severe symptoms if infection does\noccur (Supplementary Material).\nWhile ecacy against disease is of immediate benet in protecting individuals against developing\nsevere symptoms, it is the infection blocking potential of the vaccine that leads to a reduction\nin the intrinsic growth rate and the reproduction number, R. Figure 1(b) shows the reproduc-\ntion number R, on release of all non-pharmaceutical interventions, as the vaccine programme\nprogresses (but ignoring any additional increase in immunity from infection). Four dierent\nassumptions for infection ecacy (infection blocking) are considered: for zero infection ecacy\n(orange line), R  3.2, this is higher than in the rst wave due to the new variant but is re-\nduced from its theoretical maximum due to the slight depletion in susceptibles from natural\ninfection up to January 2020; whereas when infection ecacy is high (85% infection blocking,\n\n4\n\n65\n\n66\n\n67\n\n68\n\n69\n\n70\n\n71\n\n72\n\n73\n\n74\n\n75\n\n76\n\n77\n\n78\n\n79\n\n80\n\n81\n\n82\n\n83\n\n84\n\n85\n\n86\n\n87\n\n88\n\n89\n\n90\n\n91\n\n92\n\n93\n\n94\n\n95\n\n96\n\n97\n\n98\n\n99\n\n100\n\n101\n\n\f", "4": "medRxiv preprint \npreprint \n\n(which was not certified by peer review)\n\ndoi: \n\nhttps://doi.org/10.1101/2020.12.27.20248896\n; \n\nThe copyright holder for this\n is the author/funder, who has granted medRxiv a license to display the preprint in\n\nthis version posted January 26, 2021. \n\nIt is made available under a \n\nperpetuity. \nCC-BY-NC-ND 4.0 International license\n\n . \n\ngreen line), vaccination can generate a substantial decline in the reproductive number, although\nstill insucient to drive R below 1 for our default assumptions about vaccine uptake.\n\n3 Predictions under vaccination and changing NPIs\nWe simulate the infection dynamics from February 2020, matching to the observed pattern of\ncases, hospitalisations and deaths until the middle of January 2021, and then predict the impact\nof vaccination on daily deaths until the end of 2021 (Figure 2). Unsurprisingly, subsequent waves\nof infection and associated deaths are reduced by increasing levels of infection ecacy. Early,\nmodest relaxation of NPIs (Figure 2(a)), matched to the levels observed in early September\n(when R was between 1.2 and 1.4 across dierent English regions and devolved nations with\nthe old variant in predominant circulation) leads to subsequent waves of infection even under\nthe most ecacious assumptions (as displayed by the green trace, corresponding to a vaccine\nthat blocks 85% of infection). Later relaxation of NPIs (April 2021 in Figure 2(b)) provides a\ngreater opportunity for some level of herd-immunity to have accrued if the vaccine is moderately\neective at blocking infection.\nTo consider sensitivity to vaccine uptake, we analyse the total number of deaths predicted by\nthe model (Figure 2(c)), which equates to the areas under the curve in the preceding graphs.\nThe central bar represents 85%/75% and 75%/66% uptake above and below the age of 50 for\ndose 1/2 respectively (as shown in Figure 1 and the rest of Figure 2). The lower limits of each\nbox correspond to more optimistic uptake, corresponding to an increased 95% and 80% rst\ndose uptake above and below 50 years old respectively, whilst the upper limits represent a more\npessimistic scenario with 70%/60% dose 1 uptake. In both additional scenarios we retain the\nrelative 12% decrease in uptake for dose 2, in line with the central scenario.\nAssessing the predicted mortality from the start of 2021 for dierent dates at which NPI are\npartially relaxed (to the level observed in early September 2020), even maintaining these levels\nof NPI control and having a highly ecacious vaccine we estimate over fty thousand deaths\nare likely to occur from January 2021 due to the slow decline in cases from its current high level\n(Figure 2(c), left-hand panel); early relaxation of control measures or low infection ecacy can\nlead to a pronounced subsequent wave of infection.\nIf we wish to completely lift all restrictions once both phases of the vaccination campaign are\ncomplete, we predict a substantial outbreak with a large number of associated deaths (Fig-\nure 2(c), right-hand panel). When the vaccine is not infection blocking, removing NPIs triggers\nan uncontrolled wave of infection in which only those successfully immunised (approximately\n88% of 85%) will escape. Optimistic assumptions for vaccine ecacy may still lead to a further\n123 thousand deaths (54 thousand from January to July, and 69 thousand from July onwards\nwhen NPIs are released) at our expected uptake level.\nThe stepwise release of all NPIs (Figure 2(c) right-hand panel, Supplementary Material) modelled\nso far generates an over-shooting wave of infection; a more gradual release of restrictions mitigates\nthese eects (Figure 2(d-e)). A slow release of NPIs (as illustrated in Figure 2(e)) generates the\nfewest deaths, with around 99 thousand more deaths (from January 2021) forecast under our\nmost optimistic ecacy assumptions.\nThe precise dynamics and outcomes are contingent on the assumed intrinsic growth rate before\nthe relaxation of NPIs, which here is approximately R = 0.8 following a tight January lockdown\n other values for this quantity will change the precise curves but would not change the quali-\ntative conclusions. We see similar behaviour if we examine the number of daily hospitalisations\n(Supplementary Material), with a notable third wave predicted if NPIs are relaxed too early or\nif the vaccine has a limited impact on infection and hence onward transmission.\n\n102\n\n103\n\n104\n\n105\n\n106\n\n107\n\n108\n\n109\n\n110\n\n111\n\n112\n\n113\n\n114\n\n115\n\n116\n\n117\n\n118\n\n119\n\n120\n\n121\n\n122\n\n123\n\n124\n\n125\n\n126\n\n127\n\n128\n\n129\n\n130\n\n131\n\n132\n\n133\n\n134\n\n135\n\n136\n\n137\n\n138\n\n139\n\n140\n\n141\n\n142\n\n143\n\n144\n\n145\n\n146\n\n147\n\n5\n\n\f"}